## Infrastructure updates
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details>
<summary>Show infrastructure changes plan</summary>

```

data.aws_iam_policy_document.assume_role: Reading...
aws_cloudwatch_log_group.default_log_group: Refreshing state... [id=confluence-chat-staging]
data.aws_iam_policy_document.ec2_default_policy: Reading...
data.aws_iam_policy_document.assume_role: Read complete after 0s [id=1903849331]
aws_vpc.main_vpc: Refreshing state... [id=vpc-0d334a52016908598]
aws_iam_role.ec2_role: Refreshing state... [id=confluence-chatstagingEC2AccessRole]
data.aws_iam_policy_document.ec2_default_policy: Read complete after 0s [id=4157981590]
aws_iam_policy.ec2_role_policy: Refreshing state... [id=arn:aws:iam::937191605656:policy/confluence-chatstagingEC2Default]
aws_cloudwatch_log_stream.nginx_logstream: Refreshing state... [id=nginx]
aws_cloudwatch_log_stream.backend_logstream: Refreshing state... [id=app]
aws_iam_role_policy_attachment.ec2_policy_attach: Refreshing state... [id=confluence-chatstagingEC2AccessRole-20250125192157243800000001]
aws_iam_instance_profile.ec2_profile: Refreshing state... [id=confluence-chatstagingDefault]
aws_internet_gateway.inet_gateway: Refreshing state... [id=igw-0943757f13afe692d]
aws_subnet.main_subnet: Refreshing state... [id=subnet-014e243248a8c368d]
aws_security_group.main_security_group: Refreshing state... [id=sg-044eefdc3d354ab17]
aws_route_table.main_route_table: Refreshing state... [id=rtb-029c4b9d39ccb7492]
aws_route_table_association.route_table_association_1: Refreshing state... [id=rtbassoc-07ebd4e702e193cf4]
aws_instance.server: Refreshing state... [id=i-0c37537558410b953]
aws_eip.server_eip: Refreshing state... [id=eipalloc-00dca7d3c608be56a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eip.server_eip will be updated in-place
  ~ resource "aws_eip" "server_eip" {
        id                       = "eipalloc-00dca7d3c608be56a"
      ~ instance                 = "i-0c37537558410b953" -> (known after apply)
        tags                     = {}
        # (15 unchanged attributes hidden)
    }

  # aws_instance.server must be replaced
-/+ resource "aws_instance" "server" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:937191605656:instance/i-0c37537558410b953" -> (known after apply)
      ~ availability_zone                    = "us-east-1b" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "i-0c37537558410b953" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0de2c99a33042869c" -> (known after apply)
      ~ private_dns                          = "ip-10-0-0-228.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.0.228" -> (known after apply)
      ~ public_dns                           = "ec2-44-208-48-144.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "44.208.48.144" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
        tags                                 = {
            "Name" = "confluence-chat-staging-app"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      ~ user_data_base64                     = "IyEvYmluL2Jhc2gKc2V0IC1lZiAtbyBwaXBlZmFpbApzdWRvIHl1bSB1cGRhdGUgLXkKc3VkbyB5dW0gaW5zdGFsbCAteSBnaXQKRE9DS0VSX0NPTkZJRz0vaG9tZS9lYzItdXNlci8uZG9ja2VyCnN1ZG8geXVtIGluc3RhbGwgLXkgZG9ja2VyCnN1ZG8gdXNlcm1vZCAtYUcgZG9ja2VyIGVjMi11c2VyCm1rZGlyIC1wICRET0NLRVJfQ09ORklHL2NsaS1wbHVnaW5zCmN1cmwgLVNMIGh0dHBzOi8vZ2l0aHViLmNvbS9kb2NrZXIvY29tcG9zZS9yZWxlYXNlcy9kb3dubG9hZC92Mi4zMi40L2RvY2tlci1jb21wb3NlLWxpbnV4LXg4Nl82NCAtbyAkRE9DS0VSX0NPTkZJRy9jbGktcGx1Z2lucy9kb2NrZXItY29tcG9zZQpzdWRvIGNob3duIGVjMi11c2VyIC1SICRET0NLRVJfQ09ORklHCnN1ZG8gY2htb2QgK3ggJERPQ0tFUl9DT05GSUcvY2xpLXBsdWdpbnMvZG9ja2VyLWNvbXBvc2UKc3VkbyBzeXN0ZW1jdGwgc3RhcnQgZG9ja2VyLnNlcnZpY2UKc3VkbyBzeXN0ZW1jdGwgZW5hYmxlIGRvY2tlci5zZXJ2aWNlCgojIFB1dCBlbnZpcm9ubWVudCB2YXJpYWJsZXMgdG8gLmVudiBmaWxlCmNkIC9ob21lL2VjMi11c2VyL2NvbmZsdWVuY2UtY2hhdApwcmludGYgIiVzXG4iIFwKICJMT0dfTEVWRUw9SU5GTyIgXAogIkNPTkZMVUVOQ0VfRU1BSUw9dmZlbm9Abi1peC5jb20iIFwKICJDT05GTFVFTkNFX1RPS0VOPUFUQVRUM3hGZkdGMFlsczNlZ3NpOGFyX3pvdTJiOFRfQXpkQ1M1MXBDQVhhS3QzWlNPcUs3MFdSRTVwUW1Qc2JxbE8xZktidEFEX3hjb0wzQ1RvdTZNSXhWMWM1dW5yM1pVSWd3cTFtVU5VMGtmNmlpOE9wQUpiMWlCZnJJWWM0VHFPVklzd253NHNoR05qZk1DVXVrRzlCTXc0d0pjdEZyZ3loSkdxLXJNYV9fcFlUVEtxSXFjMD1GQkJCQTkwOSIKICJDT05GTFVFTkNFX0hPU1Q9aHR0cHM6Ly9uLWl4LW5vcmRpYy5hdGxhc3NpYW4ubmV0IiBcCiAiQVdTX1JFR0lPTj11cy1lYXN0LTEiIFwKICJMT0dfRFJJVkVSPWF3c2xvZ3MiIFwKICJBV1NfTE9HX0dST1VQPWNvbmZsdWVuY2UtY2hhdC1zdGFnaW5nIiBcCiAiQVdTX0JFRFJPQ0tfQ0hBVF9NT0RFTD11cy5hbnRocm9waWMuY2xhdWRlLTMtNS1zb25uZXQtMjAyNDEwMjItdjI6MCIgPj4gLmVudgo=" -> "IyEvYmluL2Jhc2gKc2V0IC1lZiAtbyBwaXBlZmFpbApzdWRvIHl1bSB1cGRhdGUgLXkKc3VkbyB5dW0gaW5zdGFsbCAteSBnaXQKRE9DS0VSX0NPTkZJRz0vaG9tZS9lYzItdXNlci8uZG9ja2VyCnN1ZG8geXVtIGluc3RhbGwgLXkgZG9ja2VyCnN1ZG8gdXNlcm1vZCAtYUcgZG9ja2VyIGVjMi11c2VyCm1rZGlyIC1wICRET0NLRVJfQ09ORklHL2NsaS1wbHVnaW5zCmN1cmwgLVNMIGh0dHBzOi8vZ2l0aHViLmNvbS9kb2NrZXIvY29tcG9zZS9yZWxlYXNlcy9kb3dubG9hZC92Mi4zMi40L2RvY2tlci1jb21wb3NlLWxpbnV4LXg4Nl82NCAtbyAkRE9DS0VSX0NPTkZJRy9jbGktcGx1Z2lucy9kb2NrZXItY29tcG9zZQpzdWRvIGNob3duIGVjMi11c2VyIC1SICRET0NLRVJfQ09ORklHCnN1ZG8gY2htb2QgK3ggJERPQ0tFUl9DT05GSUcvY2xpLXBsdWdpbnMvZG9ja2VyLWNvbXBvc2UKc3VkbyBzeXN0ZW1jdGwgc3RhcnQgZG9ja2VyLnNlcnZpY2UKc3VkbyBzeXN0ZW1jdGwgZW5hYmxlIGRvY2tlci5zZXJ2aWNlCgojIFB1dCBlbnZpcm9ubWVudCB2YXJpYWJsZXMgdG8gLmVudiBmaWxlCmNkIC9ob21lL2VjMi11c2VyL2NvbmZsdWVuY2UtY2hhdApwcmludGYgIiVzXG4iIFwKICJMT0dfTEVWRUw9SU5GTyIgXAogIkNPTkZMVUVOQ0VfRU1BSUw9dmZlbm9Abi1peC5jb20iIFwKICJDT05GTFVFTkNFX1RPS0VOPUFUQVRUM3hGZkdGMFlsczNlZ3NpOGFyX3pvdTJiOFRfQXpkQ1M1MXBDQVhhS3QzWlNPcUs3MFdSRTVwUW1Qc2JxbE8xZktidEFEX3hjb0wzQ1RvdTZNSXhWMWM1dW5yM1pVSWd3cTFtVU5VMGtmNmlpOE9wQUpiMWlCZnJJWWM0VHFPVklzd253NHNoR05qZk1DVXVrRzlCTXc0d0pjdEZyZ3loSkdxLXJNYV9fcFlUVEtxSXFjMD1GQkJCQTkwOSIgXAogIkNPTkZMVUVOQ0VfSE9TVD1odHRwczovL24taXgtbm9yZGljLmF0bGFzc2lhbi5uZXQiIFwKICJBV1NfUkVHSU9OPXVzLWVhc3QtMSIgXAogIkxPR19EUklWRVI9YXdzbG9ncyIgXAogIkFXU19MT0dfR1JPVVA9Y29uZmx1ZW5jZS1jaGF0LXN0YWdpbmciIFwKICJBV1NfQkVEUk9DS19DSEFUX01PREVMPXVzLmFudGhyb3BpYy5jbGF1ZGUtMy01LXNvbm5ldC0yMDI0MTAyMi12MjowIiA+PiAuZW52Cg==" # forces replacement
        # (11 unchanged attributes hidden)

      ~ capacity_reservation_specification (known after apply)
      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      ~ cpu_options (known after apply)
      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 1 -> null
            # (1 unchanged attribute hidden)
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      ~ ebs_block_device (known after apply)

      ~ enclave_options (known after apply)
      - enclave_options {
          - enabled = false -> null
        }

      ~ ephemeral_block_device (known after apply)

      ~ maintenance_options (known after apply)
      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      ~ metadata_options (known after apply)
      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 2 -> null
          - http_tokens                 = "required" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      ~ network_interface (known after apply)

      ~ private_dns_name_options (known after apply)
      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      ~ root_block_device {
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          - tags                  = {} -> null
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0d9553d647b76e305" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Author: @gixproject*